<a href="https://colab.research.google.com/github/kchapagain/Krishna_INFO5731_Fall2021/blob/main/INFO5731_Assignment_One.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **INFO5731 Assignment One**

# Question 1

(20 points). Write a Python program to generate 12 random numbers between 1 and 100. Sort the list of numbers in ascending order and print it out. Sort the list of numbers in descending order and print it out. Calculate the average for the group and print it out.

In [1]:
#Question(1)

import random
#Defining a function that will create 12 random intigera from 1 to 100
def rand(start, end, num): 
    list = []
    for i in range(num):
        list.append(random.randint(start,end))
    return list

#This changes the random integers into list
Group = list(rand(1,100,12))

print('Group =',Group)

#Sorting the List
Asc = sorted(Group)
Desc = sorted(Group, reverse = True)

#Average of the list
Avg = sum(Group) / len(Group)

print('Ascending Order =', Asc)
print('Descending Order =', Desc)
print('Average =', Avg)

Group = [30, 26, 3, 56, 62, 80, 86, 4, 96, 18, 99, 80]
Ascending Order = [3, 4, 18, 26, 30, 56, 62, 80, 80, 86, 96, 99]
Descending Order = [99, 96, 86, 80, 80, 62, 56, 30, 26, 18, 4, 3]
Average = 53.333333333333336

# Question 2
(25 points). Write a program that will do the following string formatting tasks:

(1) Ask the user to enter two sentences.

(2) Make each sentence into a list. Each element in the list should correspond to a word in the sentence. For example, if the sentence is "Alas! Am I alive? This is my first python program", the program should print out ['Alas, '!', 'Am', 'I', 'alive, '?', 'This', 'is', 'my', 'first', 'python', 'program'].

(3) Compare the two sentences. Print out a list of words that occur in both sentences.

(4) Remove any punctuation from the sentence and print it back out. It should remove at least the following characters, but it can remove more: period(“.”), comma (“,”), semicolon (“;”), and colon (“:”)

(5) Count the number of vowels in the sentences. Print out each vowel and the number of times it appears in the sentences, such as: a:2, e:1, i:0, etc

Input Sentences: (Please Copy and Paste below two Sentences)

Hi! This is Krishna, I am a Data Engineer and this program is to split the sentences into list.

Being a Data Engineer; we have to be careful to split the special characters too.

In [2]:
#Question 2(1):

#These are the two input sentences
sentence1 = input('Please enter the first sentence ', )
sentence2 = input('Please enter the second sentence ', )

Please enter the first sentence Hi! This is Krishna, I am a Data Engineer and this program is to split the sentences into list.
Please enter the second sentence Being a Data Engineer; we have to be careful to split the special characters too.

In [3]:
#Question 2(2):

import re
def split(sentence):
    return re.findall(r"[A-Za-z]+|\S", sentence)

list1 = list(split(sentence1)) # split function is used to get each words and characters seperate
list2 = list(split(sentence2))

print('First Sentence:  \n', list1)
print('\nSecond Sentence: \n', list2)

First Sentence:
 ['Hi', '!', 'This', 'is', 'Krishna', ',', 'I', 'am', 'a', 'Data', 'Engineer', 'and', 'this', 'program', 'is', 'to', 'split', 'the', 'sentences', 'into', 'list', '.']

Second Sentence:
 ['Being', 'a', 'Data', 'Engineer', ';', 'we', 'have', 'to', 'be', 'careful', 'to', 'split', 'the', 'special', 'characters', 'too', '.']

In [4]:
#Question 2(3):

common = []

#Extracting the common words from two sentences
for i in set(list1):
    for j in set(list2):
        if i==j and len(i)>1:
            common.append(i)

print('List of Common Words: ', common)

List of Common Words:  ['Engineer', 'the', 'to', 'Data', 'split']

In [5]:
#Question 2(4):

#Split the original sentence ignoring punctuation
def remove_punctuation(sentence):
    return re.findall(r"[A-Za-z]+", sentence)

#List of words without punctuation
list3 = list(remove_punctuation(sentence1))
list4 = list(remove_punctuation(sentence2))

#Original Sentences joining back without punctuation
sentence1_no_punctuation = ' '.join(list3)
sentence2_no_punctuation = ' '.join(list4)

#Final Original Sentences
print(sentence1_no_punctuation)
print(sentence2_no_punctuation)

Hi This is Krishna I am a Data Engineer and this program is to split the sentences into list
Being a Data Engineer we have to be careful to split the special characters too

In [6]:
#Question 2(5):

vowels = 'aeiou'
def Vow_Check(sentence):
    
    #Changing all the words lowercase
    Sent = sentence.casefold()
    
    #Assigning a dictionary
    vowel = {}.fromkeys(vowels, 0)
    
    for i in Sent:
        if i in vowel:
            vowel[i] +=1
    return vowel
        
print('Vowels in Sentence1: ', Vow_Check(sentence1_no_punctuation))
print('Vowels in Sentence2: ', Vow_Check(sentence2_no_punctuation))

Vowels in Sentence1:  {'a': 7, 'e': 7, 'i': 11, 'o': 3, 'u': 0}
Vowels in Sentence2:  {'a': 8, 'e': 11, 'i': 4, 'o': 4, 'u': 1}

# Question 3 

(15 points). The formula that describes the volume V of a sphere with radius r is the following:

$ V=\frac{4}{3}\ast\ \pi\ast\ r^3 $

Write a program to calculate the value of V when r is in the range of 1–10. Output the result in the following format:

	r	V
	1	…
	2	…
	3	…

In [7]:
#Question 3

from math import *

#Creating question format
print('r ','   ',' V')

#Applying formula and getting outputs for Volume
for r in range(1,11):
    V = (4/3)*pi*r**3
    print(r,'   ',V)

r       V
1     4.1887902047863905
2     33.510321638291124
3     113.09733552923254
4     268.082573106329
5     523.5987755982989
6     904.7786842338603
7     1436.7550402417319
8     2144.660584850632
9     3053.6280592892786
10     4188.790204786391

# Question 4

(40 points). In the field of Data Science, data is often formatted as a comma-delimited (CSV) file, where each line in a file corresponds to a field's value. Refer to Chapter 9 (p. 106) for more information on comma-delimited files. To answer this question, you will need to download the file [Assignment1_denton_housing.csv](https://github.com/unt-iialab/info5731-fall2021/blob/main/assignments/Assignment1_denton_housing.csv) included with this assignment. The file [Assignment1_denton_housing.csv](https://github.com/unt-iialab/info5731-fall2021/blob/main/assignments/Assignment1_denton_housing.csv) contains statistics about housing in the city of Denton from 2008 to 2014. Write a program to implement the following questions.

(1) (10 pts) Calculate the difference in the number of Occupied Housing Units from year to year and print it. The difference must be calculated for the consecutive years such as 2008-2009, 2009-2010 etc. Finally, print the values in the ascending order.

(2) (10 pts) For all the years, calculate the percentage of housing units which are vacant an occupied. Print the results in the following format:

Year Vacant Housing Units Occupied Housing Units

    2008  30%   70%                          
	2009 ----- -----
	2010 ----- -----
    2011 ----- -----
	2012 ----- -----
    2013 ----- -----
	2014 ----- -----
  
  

(3) (10 pts) Calculate and print the valued and years in which the highest number of housing units were vacant and occupied. Print the results in the following format:  

                              Year	Value
	Vacant Housing Units	  -----   -----
	Occupied Housing Units	-----   -----

(4) (10 pts) Calculate the harmonic mean of the total housing units and print it out. You can find the information about harmonic mean here: https://ncalculators.com/statistics/harmonic-mean-calculator.htm

In [8]:
from google.colab import files # This will import the required csv file to colab for easy access
uploaded = files.upload()

Saving Assignment1_denton_housing.csv to Assignment1_denton_housing (1).csv

In [9]:
#Question 4

#Importing the table as it is.
import pandas as pd
Housing = pd.read_csv('Assignment1_denton_housing.csv')
Housing

    year             title_field  value
0   2014     Total Housing Units  49109
1   2014    Vacant Housing Units   2814
2   2014  Occupied Housing Units  46295
3   2014          Owner Occupied  21427
4   2014         Renter Occupied  24868
5   2014       Median Gross Rent    905
6   2013     Total Housing Units  47888
7   2013    Vacant Housing Units   4215
8   2013  Occupied Housing Units  43673
9   2013          Owner Occupied  20845
10  2013         Renter Occupied  22828
11  2013       Median Gross Rent    887
12  2012     Total Housing Units  45121
13  2012    Vacant Housing Units   3013
14  2012  Occupied Housing Units  42108
15  2012          Owner Occupied  20068
16  2012         Renter Occupied  22040
17  2012       Median Gross Rent    842
18  2011     Total Housing Units  44917
19  2011    Vacant Housing Units   4213
20  2011  Occupied Housing Units  40704
21  2011          Owner Occupied  18478
22  2011         Renter Occupied  22226
23  2011       Median Gross Rent    821
24  2010     Total Housing Units  44642
25  2010    Vacant Housing Units   3635
26  2010  Occupied Housing Units  41007
27  2010          Owner Occupied  18867
28  2010         Renter Occupied  22140
29  2010       Median Gross Rent    780
30  2009     Total Housing Units  39499
31  2009    Vacant Housing Units   3583
32  2009  Occupied Housing Units  35916
33  2009          Owner Occupied  18057
34  2009         Renter Occupied  17859
35  2009       Median Gross Rent    769
36  2008     Total Housing Units  41194
37  2008    Vacant Housing Units   4483
38  2008  Occupied Housing Units  36711
39  2008          Owner Occupied  17340
40  2008         Renter Occupied  19371
41  2008       Median Gross Rent    768

In [10]:
# Organizing table to make the analysis easier

Housing_data = Housing.pivot( index = 'year',columns = 'title_field', values = 'value')
Housing_data = Housing_data.reset_index()
Housing_data

title_field  year  Median Gross Rent  ...  Total Housing Units  Vacant Housing Units
0            2008                768  ...                41194                  4483
1            2009                769  ...                39499                  3583
2            2010                780  ...                44642                  3635
3            2011                821  ...                44917                  4213
4            2012                842  ...                45121                  3013
5            2013                887  ...                47888                  4215
6            2014                905  ...                49109                  2814

[7 rows x 7 columns]

In [11]:
# Question 4(1)

Difference_Consecutive_years = pd.DataFrame()

#This will create the years range
Difference_Consecutive_years['Years_Range'] = ['2008-2009','2009-2010','2010-2011','2011-2012','2012-2013','2013-2014']

#This will calculate the consecutive difference of Occupied Housing Units
Difference_Consecutive_years['Consecutive_Difference'] = abs(Housing_data["Occupied Housing Units"].diff(-1))
print(Difference_Consecutive_years)

#Sorting the difference in ascending order
Difference_Consecutive_years.sort_values(by=['Consecutive_Difference'])

  Years_Range  Consecutive_Difference
0   2008-2009                   795.0
1   2009-2010                  5091.0
2   2010-2011                   303.0
3   2011-2012                  1404.0
4   2012-2013                  1565.0
5   2013-2014                  2622.0

  Years_Range  Consecutive_Difference
2   2010-2011                   303.0
0   2008-2009                   795.0
3   2011-2012                  1404.0
4   2012-2013                  1565.0
5   2013-2014                  2622.0
1   2009-2010                  5091.0

In [12]:
#Question 4(2)

Percent = pd.DataFrame()
Percent['Years'] = Housing_data['year']

#Calculating Percent
Percent['Vacant Housing Units'] = (Housing_data['Vacant Housing Units'] / Housing_data['Total Housing Units'])
Percent['Occupied Housing Units'] = (Housing_data['Occupied Housing Units'] / Housing_data['Total Housing Units'])

#Formatting Percent in %
Percent.style.format({'Vacant Housing Units' : "{:.2%}" , 'Occupied Housing Units' : "{:.2%}" })

In [13]:
#Question 4(3)

#Creating Category
Housing_data = Housing_data.rename(columns={'Vacant Housing Units':'Vacant_Housing_Units','Occupied Housing Units':'Occupied_Housing_Units'})

#Extracting the records with max Vaccant and Occupied data
Vacant = Housing_data[Housing_data.Vacant_Housing_Units == Housing_data.Vacant_Housing_Units.max()]
Occupied = Housing_data[Housing_data.Occupied_Housing_Units == Housing_data.Occupied_Housing_Units.max()]

#Saving max records in High Table
High = Vacant.append(Occupied)
High = High.reset_index()

#Arranging the data as per the format asked in question
Highest = pd. DataFrame()
Highest['Category'] = ['Vacant Housing Units','Occupied Housing Units']
Highest['Year'] = High['year']
Highest['Value'] = High['Vacant_Housing_Units']
Highest.at[1,'Value'] = Housing_data['Occupied_Housing_Units'].max()
Highest

                 Category  Year  Value
0    Vacant Housing Units  2008   4483
1  Occupied Housing Units  2014  46295

In [14]:
#Question 4(4)

Harmonic = pd.DataFrame()
Harmonic['Years'] = Housing_data['year']
Harmonic['Total_Housing_Units'] = Housing_data['Total Housing Units']

#This will calculate inverse of each records in Total Housing Units
Harmonic['Inverse_Total_Housing_Units'] = 1/Harmonic['Total_Housing_Units']
Harmonic

   Years  Total_Housing_Units  Inverse_Total_Housing_Units
0   2008                41194                     0.000024
1   2009                39499                     0.000025
2   2010                44642                     0.000022
3   2011                44917                     0.000022
4   2012                45121                     0.000022
5   2013                47888                     0.000021
6   2014                49109                     0.000020

In [15]:
#Applying the Harmonic Mean Formula
Harmonic_Mean = len(Harmonic.Years)/(Harmonic.Inverse_Total_Housing_Units.sum())
print('The Harmonic Mean of Total Housing Units is :' , Harmonic_Mean)

The Harmonic Mean of Total Housing Units is : 44398.28543969185